<?php  
namespace Home\Model;
use Think\Model;

/**
 * 邮箱注册模型层
 */
// class UserModel extends \Think\Model
// {
//     // 自动验证
// 	 protected $_validate = [

//         // 用户名判断
//         ['username', 'require', '请输入用户名!'],

//         ['username', '/^[a-zA-Z0-9\u4E00-\u9FFF]{1,}$/', '格式错误，仅支持汉字、字母、数字组合'],

//         ['username', '/[a-zA-Z0-9\u4E00-\u9FFF]{4,20}/', '用户名长度只能在4-20个字符之间'],

//         ['username', '/^[0-9]{1,}$/', '用户名不能是纯数字，请重新输入！'],

//         ['username', '', '此用户名太受欢迎,请更换一个', 0,'unique',1],



//         // 密码判断
//         ['password', 'require', '请输入密码!'],

//         ['password', '/[\w\s`~!@#$%^&*()-_+=<>?:"{},.|\/;\'[\]]{6,20}/', '密码长度只能在6-20个字符之间'],
        
//         // 如果用户在设置密码框输入的是6-10位纯数字
//         ['password', '/^[\d]{6,10}$/', '有被盗风险,建议使用字母、数字和符号两种以上组合'],

//         // 如果用户在设置密码框输入的是6-10位纯字母
//         ['password', '/^[a-zA-Z]{6,10}$/', '有被盗风险,建议使用字母、数字和符号两种以上组合'],

//         // 如果用户在设置密码框输入的是6-10位纯特殊字符
//         ['password', '/^[`~!@#$%^&*()-_+=<>?:"{},.|\/;\'[\]]{6,10}$/', '有被盗风险,建议使用字母、数字和符号两种以上组合'],

//         // 如果用户在设置密码框输入的是6-10位纯空格
//         ['password', '/^[\s]{6,10}$/', '有被盗风险,建议使用字母、数字和符号两种以上组合'],


//         // 如果用户在设置密码框输入的是11-20位纯数字
//         ['password', '/^[\d]{11,20}$/', '安全强度适中，可以使用三种组合来提高安全强度'],

//         // 如果用户在设置密码框输入的是11-20位纯字母
//         ['password', '/^[a-zA-Z]{11,20}$/', '安全强度适中，可以使用三种组合来提高安全强度'],

//         // 如果用户在设置密码框输入的是11-20位纯特殊字符
//         ['password', '/^[`~!@#$%^&*()-_+=<>?:"{},.|\/;\'[\]]{11,20}$/', '安全强度适中，可以使用三种组合来提高安全强度'],

//         // 如果用户在设置密码框输入的是11-20位纯空格
//         ['password', '/^[\s]{11,20}$/', '安全强度适中，可以使用三种组合来提高安全强度'],

//         // 如果用户在设置密码框输入的是6-10位数字和字母的组合
//         ['password', '/^[\da-zA-Z]{6,10}$/', '安全强度适中，可以使用三种组合来提高安全强度'],

//         // 如果用户在设置密码框输入的是6-10位数字和特殊字符的组合
//         ['password', '/^[`~!@#$%^&*()-_+=<>?:"{},.|\/;\'[\]\d]{6,10}$/', '安全强度适中，可以使用三种组合来提高安全强度'],

//         // 如果用户在设置密码框输入的是6-10位数字和空格的组合
//         ['password', '/^[\d\s]{6,10}$/', '安全强度适中，可以使用三种组合来提高安全强度'],

//         // 如果用户在设置密码框输入的是6-10位字母和特殊字符的组合
//         ['password', '/^[`~!@#$%^&*()-_+=<>?:"{},.|\/;\'[\]a-zA-Z]{6,10}$/', '安全强度适中，可以使用三种组合来提高安全强度'],

//         // 如果用户在设置密码框输入的是6-10位字母和空格的组合
//         ['password', '/^[a-zA-Z\s]{6,10}$/', '安全强度适中，可以使用三种组合来提高安全强度'],

//         // 如果用户在设置密码框输入的是6-10位特殊字符和空格的组合
//         ['password', '/^[`~!@#$%^&*()-_+=<>?:"{},.|\/;\'[\]\s]{6,10}$/', '安全强度适中，可以使用三种组合来提高安全强度'],


//         ['passwordRepeat', 'require', '请输入确认密码!'],

//         ['passwordRepeat', 'password','require', '前后密码不一致'],


//         ['email', 'require', '请输入邮箱账号!'],

//         ['email', '/^[a-z0-9]+([._\\-]*[a-z0-9])*@([a-z0-9]+[-a-z0-9]*[a-z0-9]+.){1,63}[a-z0-9]+$/', '邮箱账号格式不正确'],

//         ['email', '', '该邮箱已被注册', 0,'unique',1],
        

//         ['emailcode', 'require', '请输入验证码!'],
//     ];
// }
?>